{"authentication":{"headline":"Authentication","path":"solutions/authentication","image":"./solutions/authentication/authentication_flow.png","snippet":"\nAccess control is an important aspect for the security in IT application landscapes. There are two different aspects to distinguish:\n"},"authorization":{"headline":"Authorization","path":"solutions/authorization","image":"./solutions/authorization/authentication-vs-authorization.png","snippet":"\nAccess control is an important aspect for the security in IT application landscapes. There are two different aspects to distinguish: authentication and authorization.\n"},"cloudwatchCustomiceAlarmMessage":{"headline":"Customise your cloudwatch alerts","path":"solutions/cloudwatchCustomiceAlarmMessage","image":"","snippet":"\nCloudwatch alarms give you the ability to notify you in case an alarm is triggered. The standard message layout of cloudwatch is very inflexible and not customisable. With this approach it is possible to fill HTML templates with further information, links and buttons to find the solution ASAP.\n"},"communication":{"headline":"Communication among services","path":"solutions/communication","image":"./solutions/communication/communication-type.svg","snippet":"\nCommunication is a very important aspect while building IT application, especially large and complex one or one with microservices architecture. Based on your analysis of your problems, considering the following basic questions to start with:\n"},"hexgagonalArchitecture":{"headline":"Hexagonal architecture","path":"solutions/hexgagonalArchitecture","image":"./solutions/hexgagonalArchitecture/hexagonal.png","snippet":"\nThis article explains so-called Hexagonal Architecture which is one of architectural styles applicable for wide variety of applications / software.\n"},"microsvc_platforms_intro":{"headline":"Microservice Platforms Introduction","path":"solutions/microsvc_platforms_intro","image":"./solutions/microsvc_platforms_intro/problem_context.png","snippet":"\nMicroservice orchestration is the automatic process of managing or scheduling the work of individual microservices of an application within multiple clusters. The platform provides an automated process of managing, scaling, and maintaining microservices of an applications.\n"},"microsvc_platforms_intro_azure_aks":{"headline":"Azure Microservice Platforms Solution AKS","path":"solutions/microsvc_platforms_intro_azure_aks","image":"./solutions/microsvc_platforms_intro_azure_aks/complementing_services.png","snippet":"\nTODO kubernetes core\n"},"monitoring":{"headline":"Azure Monitoring","path":"solutions/monitoring","image":"./solutions/monitoring/Monitoring.png","snippet":"\nUsed definition: A monitoring solution helps the monitoring consumer achieve the satisfactory level of control of a defined service. [1]\n"},"openTelemetry":{"headline":"Monitoring your microservices with openTelemetry","path":"solutions/openTelemetry","image":"./solutions/openTelemetry/openTelemetry_architecture.svg","snippet":"\nWith the complexity and size of microservice systems, which include hundreds of small services, keeping an overview can be quite challenging. Usually one monolitic application can be scanned for potential errors, as failures in the system directly reference this one application. With microservices the area to search in could be narrowed down, but never to an extend adressing one specific service being the root cause. Therefore, to keep track of runtime problems and the fullfillment of nonfunct ..."},"provisioning":{"headline":"Provisioning","path":"solutions/provisioning","image":"./solutions/provisioning/problem_context.png","snippet":"\nThis document describes patterns to automate the deployment of an application to a target environment. The major players in this documentation are (1) the process as a whole (aka provisioning), (2) automation code and (3) application/ infra code to be deployed.\n"}}